consult-mu.org
* consult-mu.el
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :comments none :tangle ./consult-mu.el
:END:
** Header
#+begin_src emacs-lisp
;;; consult-mu.el --- Consult Mu4e asynchronously -*- lexical-binding: t -*-

;; Copyright (C) 2023 Armin Darvish

;; Author: Armin Darvish
;; Maintainer: Armin Darvish
;; Created: 2023
;; Version: 1.0
;; Package-Requires: ((emacs "28.0") (consult "2.0"))
;; Keywords: convenience, matching, tools, email
;; Homepage: https://github.com/armindarvish/consult-mu

;; SPDX-License-Identifier: GPL-3.0-or-later

;; This file is free software: you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published
;; by the Free Software Foundation, either version 3 of the License,
;; or (at your option) any later version.
;;
;; This file is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.
;;
;; You should have received a copy of the GNU General Public License
;; along with this file.  If not, see <https://www.gnu.org/licenses/>.


;;; Commentary:

;; This package provides an alternative interactive serach interface for
;; mu and mu4e (see URL `https://djcbsoftware.nl/code/mu/mu4e.html').
;; It uses a consult-based minibuffer completion for searching and
;; selecting, and marking emails, as well as additional utilities for
;; composing emails and more.

;;  This package requires mu4e version "1.10.8" or later.

;;; Code:

#+end_src

** Requirements
#+begin_src emacs-lisp
;;; Requirements
(require 'consult)
(require 'mu4e)

#+end_src

** Define Group, Customs, Vars, etc.
*** Group
#+begin_src emacs-lisp
;;; Group

(defgroup consult-mu nil
  "Options for `consult-mu'."
  :group 'convenience
  :group 'minibuffer
  :group 'consult
  :group 'mu4e
  :prefix "consult-mu-")

#+end_src

*** Custom Variables
#+begin_src emacs-lisp
;;; Customization Variables

(defcustom consult-mu-args '("mu")
  "Command line arguments to call `mu` asynchronously.

The dynamically computed arguments are appended.
Can be either a string, or a list of strings or expressions."
  :group 'consult-mu
  :type '(choice string (repeat (choice string sexp))))

(defcustom consult-mu-maxnum mu4e-search-results-limit
  "Maximum number of results.

This is normally passed to “--maxnum” in the command line or is defined by
`mu4e-search-results-limit'.  By default inherits from
`mu4e-search-results-limit'."
  :group 'consult-mu
  :type '(choice (const :tag "Unlimited" -1)
                 (integer :tag "Limit")))

(defcustom consult-mu-search-sort-field mu4e-search-sort-field
  "What field to sort results by?

By defualt inherits from `mu4e-search-sort-field'."
  :group 'consult-mu
  :type '(radio (const :tag "Date" :date)
                (const :tag "Subject" :subject)
                (const :tag "File Size" :size)
                (const :tag "Priority" :prio)
                (const :tag "From (Sender)" :from)
                (const :tag "To (Recipients)" :to)
                (const :tag "Mailing List" :list)))

(defcustom consult-mu-headers-fields mu4e-headers-fields
  "A list of header fields to show in the headers buffer.

By default inherits from `mu4e-headers-field'.

From mu4e docs:

Each element has the form (HEADER . WIDTH), where HEADER is one of
the available headers (see `mu4e-header-info') and WIDTH is the
respective width in characters.

A width of nil means “unrestricted”, and this is best reserved
for the rightmost \(last\) field.  Note that Emacs may become very
slow with excessively long lines \(1000s of characters\), so if you
regularly get such messages, you want to avoid fields with nil
altogether."
  :group 'consult-mu
  :type `(repeat (cons (choice ,@(mapcar (lambda (h)
                                           (list 'const
                                                 :tag (plist-get (cdr h) :help)
                                                 (car h)))
                                         mu4e-header-info))
                       (choice (integer :tag "width")
                               (const :tag "unrestricted width" nil)))))

(defcustom consult-mu-headers-template nil
  "A template string to make custom header formats.

If non-nil, `consult-mu' uses this string to format the headers instead of
`consult-mu-headers-field'.

The string should be of the format “%[char][integer]%[char][integer]...”,
and allow dynamic insertion of the content.  Each “%[char][integer]“ chunk
represents a different field and the integer defines the length of the
field.

The list of available fields are:

  %f  sender(s) \(e.g. from: field of email\)
  %t  receivers(s) \(i.e. to: field of email\)
  %s  subject \(i.e. title of email\)
  %d  date \(i.e. the date email was sent/received\)
  %p  priority
  %z  size
  %i  message-id \(as defined by mu\)
  %g  flags \(as defined by mu\)
  %G  pretty flags \(this uses `mu4e~headers-flags-str' to pretify flags\)
  %x  tags \(as defined by mu\)
  %c  cc \(i.e. cc: field of the email\)
  %h  bcc \(i.e. bcc: field of the email\)
  %r  date chaged \(as defined by :changed in mu4e\)

For exmaple, “%d15%s50” means 15 characters for date and 50 charcters for
subject, and “%d13%s37%f17” would make a header containing 13 characters
for Date, 37 characters for Subject, and 20 characters for From field,
making a header that looks like this:

Thu 09 Nov 23  Title of the Email Limited to 50 Char...  example@domain..."
  :group 'consult-mu
  :type '(choice (const :tag "Fromatted String" :format "%{%%d13%%s50%%f17%}")
                 (function :tag "Custom Function")))

(defcustom consult-mu-search-sort-direction mu4e-search-sort-direction
  "Direction to sort by a symbol.

By defualt inherits from `mu4e-search-sort-direction', and can either be
\='descending (sorting  Z->A) or \='ascending (sorting A->Z)."

  :group 'consult-mu
  :type '(radio (const ascending)
                (const descending)))


(defcustom consult-mu-search-threads mu4e-search-threads
  "Whether to calculate threads for search results.

By defualt inherits from `mu4e-search-threads'.

Note that per mu4e docs:
When threading is enabled, the headers are exclusively sorted
chronologically (:date) by the newest message in the thread."
  :group 'consult-mu
  :type 'boolean)

(defcustom consult-mu-group-by nil
  "What field to use to group the results in the minibuffer.

By default it is set to :date, but can be any of:

  :subject      group by subject
  :from         group by the name/email the sender(s)
  :to           group by name/email of the reciver(s)
  :date         group by date
  :time         group by the time of email \(i.e. hour, minute, seconds\)
  :datetime     group by date and time of the email
  :year         group by the year of the email \(i.e. 2023, 2022, ...\)
  :month        group by the month of the email \(i.e. Jan, Feb, ..., Dec\)
  :week         group by the week number of the email
                \(i.e. 1st week, 2nd week, ... 52nd week\)
  :day-of-week  group by the day email was sent (i.e. Mondays, Tuesdays, ...)
  :day          group by the day email was sent (similar to :day-of-week)
  :size         group by the file size of the email
  :flags        group by flags (as defined by mu)
  :tags         group by tags (as defined by mu)
  :changed      group by the date changed
                \(as defined by :changed field in mu4e\)"
  :group 'consult-mu
  :type '(radio (const :date)
                (const :subject)
                (const :from)
                (const :to)
                (const :time)
                (const :datetime)
                (const :year)
                (const :month)
                (const :week)
                (const :day-of-week)
                (const :day)
                (const :size)
                (const :flags)
                (const :tags)
                (const :changed)
                (const nil)))

(defcustom consult-mu-mark-previewed-as-read nil
  "Whether to mark PREVIEWED emails as read or not?"
  :group 'consult-mu
  :type 'boolean)

(defcustom consult-mu-mark-viewed-as-read t
  "Whether to mark VIEWED emails as read or not?"
  :group 'consult-mu
  :type 'boolean)

(defcustom consult-mu-headers-buffer-name "*consult-mu-headers*"
  "Default name for HEADERS buffer explicitly for `consult-mu'.

For more info see `mu4e-headers-buffer-name'."
  :group 'consult-mu
  :type 'string)

(defcustom consult-mu-view-buffer-name "*consult-mu-view*"
  "Default name for VIEW buffer explicitly for `consult-mu'.

For more info see `mu4e-view-buffer-name'."
  :group 'consult-mu
  :type 'string)

(defcustom consult-mu-preview-key consult-preview-key
  "Preview key for `consult-mu'.

This is similar to `consult-preview-key' but explicitly for `consult-mu'."
  :group 'consult-mu
  :type '(choice (symbol :tag "Any key" 'any)
                 (list :tag "Debounced"
                       (const :debounce)
                       (float :tag "Seconds" 0.1)
                       (const any))
                 (const :tag "No preview" nil)
                 (key :tag "Key")
                 (repeat :tag "List of keys" key)))


(defcustom consult-mu-highlight-matches t
  "Should `consult-mu' highlight search queries in preview buffers?"
  :group 'consult-mu
  :type 'boolean)

(defcustom consult-mu-use-wide-reply 'ask
  "Reply to all or not?

This defines whether `consult-mu--reply-action' should reply to all or not."
  :group 'consult-mu
  :type '(choice (symbol :tag "Ask for confirmation" 'ask)
                 (const :tag "Do not reply to all" nil)
                 (const :tag "Always reply to all" t)))

(defcustom consult-mu-action #'consult-mu--view-action
  "The function that is used when selecting a message.
By default it is bound to `consult-mu--view-action'."
  :group 'consult-mu
  :type '(choice (function :tag "(Default) View Message in Mu4e Buffers" consult-mu--view-action)
                 (function :tag "Reply to Message" consult-mu--reply-action)
                 (function :tag "Forward Message" consult-mu--forward-action)
                 (function :tag "Custom Function")))

(defcustom consult-mu-default-command #'consult-mu-dynamic
  "Which command should `consult-mu' call."
  :group 'consult-mu
  :type '(choice (function :tag "(Default) Use Dynamic Collection (i.e. `consult-mu-dynamic')" #'consult-mu-dynamic)
                 (function :tag "Use Async Collection (i.e. `consult-mu-async')"  #'consult-mu-async)
                 (function :tag "Custom Function")))

#+end_src

*** Other Variables
#+begin_src emacs-lisp
;;; Other Variables
(defvar consult-mu-category 'consult-mu
  "Category symbol for the `consult-mu' package.")

(defvar consult-mu-messages-category 'consult-mu-messages
  "Category symbol for messages in `consult-mu' package.")

(defvar consult-mu--view-buffers-list (list)
  "List of currently open preview buffers for `consult-mu'.")

(defvar consult-mu--history nil
  "History variable for `consult-mu'.")

(defvar consult-mu-delimiter "      "
  "Delimiter to use for fields in mu command output.

The idea is Taken from  https://github.com/seanfarley/counsel-mu.")

(defvar consult-mu-saved-searches-dynamic (list)
  "List of Favorite searches for `consult-mu-dynamic'.")

(defvar consult-mu-saved-searches-async consult-mu-saved-searches-dynamic
  "List of Favorite searches for `consult-mu-async'.")

(defvar consult-mu--override-group nil
  "Override grouping in `consult-mu' based on user input.")

(defvar consult-mu--mail-headers '("Subject" "From" "To" "From/To" "Cc" "Bcc" "Reply-To" "Date" "Attachments" "Tags" "Flags" "Maildir" "Summary" "List" "Path" "Size" "Message-Id" "List-Id" "Changed")
  "List of possible headers in a message.")

#+end_src

** Define faces
#+begin_src emacs-lisp
;;; Faces

(defface consult-mu-highlight-match-face
  `((t :inherit 'consult-highlight-match))
  "Highlight match face in `consult-mu' view buffer.

By default inherits from `consult-highlight-match'.
This is used to highlight matches of search queries in the minibufffer
completion list.")

(defface consult-mu-preview-match-face
  `((t :inherit 'consult-preview-match))
  "Preview match face in `consult-mu' preview buffers.

By default inherits from `consult-preview-match'.
This is used to highlight matches of search query terms in preview buffers
\(i.e. `consult-mu-view-buffer-name'\).")

(defface consult-mu-default-face
  `((t :inherit 'default))
  "Default face in `consult-mu' minibuffer annotations.

By default inherits from `default' face.")

(defface consult-mu-subject-face
  `((t :inherit 'font-lock-keyword-face))
  "Subject face in `consult-mu' minibuffer annotations.

By default inherits from `font-lock-keyword-face'.")

(defface consult-mu-sender-face
  `((t :inherit 'font-lock-variable-name-face))
  "Contact face in `consult-mu' minibuffer annotations.

By default inherits from `font-lock-variable-name-face'.")

(defface consult-mu-receiver-face
  `((t :inherit 'font-lock-variable-name-face))
  "Contact face in `consult-mu' minibuffer annotations.

By default inherits from `font-lock-variable-name-face'.")

(defface consult-mu-date-face
  `((t :inherit 'font-lock-preprocessor-face))
  "Date face in `consult-mu' minibuffer annotations.

By default inherits from `font-lock-preprocessor-face'.")

(defface consult-mu-count-face
  `((t :inherit 'font-lock-string-face))
  "Count face in `consult-mu' minibuffer annotations.

By default inherits from `font-lock-string-face'.")

(defface consult-mu-size-face
  `((t :inherit 'font-lock-string-face))
  "Size face in `consult-mu' minibuffer annotations.

By default inherits from `font-lock-string-face'.")

(defface consult-mu-tags-face
  `((t :inherit 'font-lock-comment-face))
  "Tags/Comments face in `consult-mu' minibuffer annotations.

By default inherits from `font-lock-comment-face'.")

(defface consult-mu-flags-face
  `((t :inherit 'font-lock-function-call-face))
  "Flags face in `consult-mu' minibuffer annotations.

By default inherits from `font-lock-function-call-face'.")

(defface consult-mu-url-face
  `((t :inherit 'link))
  "URL face in `consult-mu' minibuffer annotations;

By default inherits from `link'.")

#+end_src

** Backend functions
This section includes functions (utilities, mu4e hacks, ...).
*** general utility
**** pulses
***** pulse-regexp
#+begin_src emacs-lisp
(defun consult-mu--pulse-regexp (regexp)
  "Find and pulse REGEXP."
  (goto-char (point-min))
  (while (re-search-forward regexp nil t)
    (when-let* ((m (match-data))
                (beg (car m))
                (end (cadr m))
                (ov (make-overlay beg end))
                (pulse-delay 0.075))
      (pulse-momentary-highlight-overlay ov 'highlight))))

#+end_src
***** pulse-region
#+begin_src emacs-lisp
(defun consult-mu--pulse-region (beg end)
  "Find and pulse region from BEG to END."
  (let ((ov (make-overlay beg end))
        (pulse-delay 0.075))
    (pulse-momentary-highlight-overlay ov 'highlight)))

#+end_src
***** pulse-line
#+begin_src emacs-lisp
(defun consult-mu--pulse-line ()
  "Pulse line at point momentarily."
  (let* ((pulse-delay 0.055)
         (ov (make-overlay (car (bounds-of-thing-at-point 'line))
                           (cdr (bounds-of-thing-at-point 'line)))))
    (pulse-momentary-highlight-overlay ov 'highlight)))

#+end_src

**** formatting strings
