extras/consult-mu-compose.el
;;; consult-mu-compose.el --- Consult Mu4e asynchronously -*- lexical-binding: t -*-

;; Copyright (C) 2023 Armin Darvish

;; Author: Armin Darvish
;; Maintainer: Armin Darvish
;; Created: 2023
;; Version: 1.0
;; Package-Requires: ((emacs "28.0") (consult "2.0"))
;; Homepage: https://github.com/armindarvish/consult-mu
;; Keywords: convenience, matching, tools, email
;; Homepage: https://github.com/armindarvish/consult-mu

;; SPDX-License-Identifier: GPL-3.0-or-later

;; This file is free software: you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published
;; by the Free Software Foundation, either version 3 of the License,
;; or (at your option) any later version.
;;
;; This file is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.
;;
;; You should have received a copy of the GNU General Public License
;; along with this file.  If not, see <https://www.gnu.org/licenses/>.


;;; Commentary:

;; This package provides an alternative interactive serach interface for
;; mu and mu4e (see URL `https://djcbsoftware.nl/code/mu/mu4e.html').
;; It uses a consult-based minibuffer completion for searching and
;; selecting, and marking emails, as well as additional utilities for
;; composing emails and more.

;;  This package requires mu4e version "1.10.8" or later.

;;; Code:

(require 'consult-mu)

;;; Customization Variables
(defcustom consult-mu-compose-use-dired-attachment 'in-dired
  "Use a Dired buffer for multiple file attachment?

If set to \='in-dired uses `dired' buffer and `dired' marks only when inside
a `dired' buffer.  If \='t, a `dired' buffer will be used for selecting attachment files similar to what Doom Emacs does:
URL `https://github.com/doomemacs/doomemacs/blob/bea81278fd2ecb65db6a63dbcd6db2f52921ee41/modules/email/mu4e/autoload/email.el#L272'.

If \='nil, consult-mu uses minibuffer completion for selection files to
attach, even if inside a `dired' buffer.

By default this is set to \='in-dired."
  :group 'consult-mu
  :type '(choice (const :tag "Only use Dired if inside Dired Buffer" 'in-dired)
                 (const :tag "Always use Dired" t)
                 (const :tag "Never use Dired" nil)))

(defcustom consult-mu-large-file-warning-threshold large-file-warning-threshold
  "Threshold for size of file to require confirmation for preview.

This is used when selecting files to attach to emails.  Files larger than this value in size will require user confirmation before previewing the file.  Default value is set by `large-file-warning-threshold'.  If nil, no cofnirmation is required."
  :group 'consult-mu
  :type '(choice integer (const :tag "Never request confirmation" nil)))


(defcustom consult-mu-compose-preview-key consult-mu-preview-key
  "Preview key for `consult-mu-compose'.

This is similar to `consult-mu-preview-key' but explicitly for
consult-mu-compose.  It is recommended to set this to something other than
\='any to avoid loading preview buffers for each file."
  :group 'consult-mu
  :type '(choice (const :tag "Any key" any)
                 (list :tag "Debounced"
                       (const :debounce)
                       (float :tag "Seconds" 0.1)
                       (const any))
                 (const :tag "No preview" nil)
                 (key :tag "Key")
                 (repeat :tag "List of keys" key)))

(defcustom consult-mu-embark-attach-file-key nil
  "Embark key binding for interactive file attachement."
  :group 'consult-mu
  :type '(choice (key :tag "Key")
                 (const :tag "no key binding" nil)))

(defvar consult-mu-compose-attach-history nil
  "History variable for file attachment.

It is used in `consult-mu-compose--read-file-attach'.")

(defvar consult-mu-compose-current-draft-buffer nil
  "Store the buffer that is being edited.")

(defun consult-mu-compose--read-file-attach (&optional initial)
  "Read files in the minibuffer to attach to an email.

INITIAL is the initial input in the minibuffer."
  (consult--read (completion-table-in-turn #'completion--embedded-envvar-table
                                           #'completion--file-name-table)
                 :prompt "Attach File: "
                 :require-match t
                 :category 'file
                 :initial (or initial default-directory)
                 :lookup (lambda (sel cands &rest args)
                           (file-truename sel))
                 :state (lambda (action cand)
                          (let ((preview (consult--buffer-preview)))
                            (pcase action
                              ('preview
                               (if cand
                                   (when (not (file-directory-p cand))
                                     (let* ((filename (file-truename cand))
                                            (filesize (float
                                                       (file-attribute-size
                                                        (file-attributes filename))))
                                            (confirm (if (and filename
                                                              (>= filesize consult-mu-large-file-warning-threshold))
                                                         (yes-or-no-p (format "File is %s Bytes.  Do you really want to preview it?" filesize))
                                                       t)))
                                       (if confirm
                                           (funcall preview action
                                                    (find-file-noselect (file-truename cand))))))))
                              ('return
                               cand))))
                 :preview-key consult-mu-compose-preview-key
                 :add-history (list mu4e-attachment-dir)
                 :history 'consult-mu-compose-attach-history))

(defun consult-mu-compose--read-file-remove (&optional initial)
