consult-mu.org
**** read file to remove
#+begin_src emacs-lisp
(defun consult-mu-compose--read-file-remove (&optional initial)
  "Select attached files to remove from email.

INITIAL is the initial input in the minibuffer."

  (if-let ((current-files (pcase major-mode
                            ('org-msg-edit-mode
                             (org-msg-get-prop "attachment"))
                            ((or 'mu4e-compose-mode 'message-mode)
                             (goto-char (point-max))
                             (cl-loop while (re-search-backward "<#part.*filename=\"\\(?1:.*\\)\"[[:ascii:][:nonascii:]]*?/part>" nil t)
                                      collect (match-string-no-properties 1)))
                            (_
                             (error "Not in a compose message buffer")
                             nil))))

      (consult--read current-files
                     :prompt "Remove File:"
                     :category 'file
                     :state (lambda (action cand)
                              (let ((preview (consult--buffer-preview)))
                                (pcase action
                                  ('preview
                                   (if cand
                                       (when (not (file-directory-p cand))
                                         (let* ((filename (file-truename cand))
                                                (filesize (float
                                                           (file-attribute-size
                                                            (file-attributes filename))))
                                                (confirm (if (and filename
                                                                  (>= filesize consult-mu-large-file-warning-threshold))
                                                             (yes-or-no-p (format "File is %s Bytes.  Do you really want to preview it?" filesize))
                                                           t)))
                                           (if confirm
                                               (funcall preview action
                                                        (find-file-noselect (file-truename cand))))))))
                                  ('return
                                   cand))))
                     :preview-key consult-mu-compose-preview-key
                     :initial initial)
    (progn
      (message "No files currently attached!")
      nil)))

#+end_src

**** get draft buffer
#+begin_src emacs-lisp
(defun consult-mu-compose-get-draft-buffer ()
  "Query user to select a mu4e compose draft buffer."
  (save-excursion
  (if (and (consult-mu-compose-get-current-buffers)
           (y-or-n-p "Attach the files to an existing compose buffer? "))
      (consult--read (consult-mu-compose-get-current-buffers)
                     :prompt "Select Message Buffer: "
                     :require-match nil
                     :category 'consult-mu-messages
                     :preview-key consult-mu-preview-key
                     :lookup (lambda (sel cands &rest args)
                               (or (get-buffer sel) sel))
                     :state (lambda (action cand)
                              (let ((preview (consult--buffer-preview)))
                                (pcase action
                                  ('preview
                                   (if (and cand (buffer-live-p cand))
                                       (funcall preview action
                                                cand)))
                                  ('return
                                   cand))))))))

#+end_src
**** get current compose buffers
#+begin_src emacs-lisp
(defun consult-mu-compose-get-current-buffers ()
  "Return a list of active compose message buffers."
  (let (buffers)
    (save-current-buffer
      (dolist (buffer (buffer-list t))
        (set-buffer buffer)
        (when (or (and (derived-mode-p 'message-mode)
                       (null message-sent-message-via))
                  (derived-mode-p 'org-msg-edit-mode)
                  (derived-mode-p 'mu4e-compose-mode))
          (push (buffer-name buffer) buffers))))
    (nreverse buffers)))
#+end_src
*** actions
**** add attachment
***** attach a file
#+begin_src emacs-lisp
(defun consult-mu-compose--attach-files (files &optional mail-buffer &rest _args)
  "Attach FILES to email in MAIL-BUFFER compose buffer."
  (let ((files (if (stringp files) (list files) files))
        (mail-buffer (or mail-buffer (if (version<= mu4e-mu-version "1.12")
                                 (mu4e-compose 'new) (mu4e-compose-new)))))
    (with-current-buffer mail-buffer
      (pcase major-mode
        ('org-msg-edit-mode
         (save-excursion
           (let* ((new-files (delete-dups (append (org-msg-get-prop "attachment") files))))
             (org-msg-set-prop "attachment" new-files))
           (goto-last-change 0)
           (org-reveal)
           (consult-mu--pulse-line)))
        ((or 'mu4e-compose-mode 'message-mode)
         (save-excursion
           (dolist (file files)
             (goto-char (point-max))
             (unless (eq (current-column) 0)
               (insert "\n\n")
               (forward-line 2))
             (mail-add-attachment (file-truename file))
             (goto-last-change 0)
             (forward-line -2)
             (consult-mu--pulse-line))))
        (_
         (error "%s is not a compose buffer" (current-buffer)))))))
#+end_src

**** remove attachment
#+begin_src emacs-lisp
(defun consult-mu-compose--remove-files (files &optional mail-buffer &rest _args)
  "Remove FILES from current attachments in MAIL-BUFFER."
  (let ((files (if (stringp files) (list files) files))
        (mail-buffer (or mail-buffer (current-buffer))))
    (with-current-buffer mail-buffer
      (save-excursion
        (pcase major-mode
          ('org-msg-edit-mode
           (let ((current-files (org-msg-get-prop "attachment"))
                 (removed-files (list)))
             (mapcar (lambda (file)
                       (when (member file current-files)
                         (org-msg-set-prop "attachment" (delete-dups (remove file current-files)))
                         (add-to-list 'removed-files file)
                         (setq current-files (org-msg-get-prop "attachment"))
                         (goto-last-change 0)
                         (org-reveal)
                         (consult-mu--pulse-line)))
                     files)
             (message "file(s) %s detached" (mapconcat 'identity removed-files ","))))
          ('mu4e-compose-mode
           (let ((removed-files (list)))
             (mapcar (lambda (file)
                       (goto-char (point-min))
                       (while (re-search-forward (format "<#part.*filename=\"%s\"[[:ascii:][:nonascii:]]*?/part>" file) nil t)
                         (replace-match "" nil nil)
                         (setq removed-files (append removed-files (list file)))
                         (goto-last-change 0)
                         (consult-mu--pulse-line)
                         (whitespace-cleanup)))
                     files)
             (message "file(s) %s detached" (mapconcat 'identity removed-files ", ")))))))))
#+end_src

