consult-mu.org
** Frontend Interactive Commands
#+begin_src emacs-lisp
(defun consult-mu-compose-attach (&optional files mail-buffer)
  "Attach FILES to email in MAIL-BUFFER interactively.

MAIL-BUFFER defaults to `consult-mu-compose-current-draft-buffer'."
  (interactive)
  (let* ((consult-mu-compose-current-draft-buffer (cond
                                                   ((or (derived-mode-p 'mu4e-compose-mode) (derived-mode-p 'org-msg-edit-mode) (derived-mode-p 'message-mode)) (current-buffer))
                                                   ((derived-mode-p 'dired-mode)
                                                    (and (bound-and-true-p dired-mail-buffer) (buffer-live-p dired-mail-buffer) dired-mail-buffer))
                                                   (t
                                                    consult-mu-compose-current-draft-buffer)))
         (mail-buffer (or mail-buffer
                          (and (buffer-live-p consult-mu-compose-current-draft-buffer) consult-mu-compose-current-draft-buffer)
                          nil))
         (files (or files
                    (if (and (derived-mode-p 'dired-mode) consult-mu-compose-use-dired-attachment)
                        (delq nil
                              (mapcar
                               ;; don't attach directories
                               (lambda (f) (if (file-directory-p f)
                                               nil
                                             f))
                               (nreverse (dired-map-over-marks (dired-get-filename) nil))))
                      (consult-mu-compose--read-file-attach files)))))
    (pcase major-mode
      ((or 'mu4e-compose-mode 'org-msg-edit-mode 'message-mode)
       (setq mail-buffer (current-buffer))
       (setq consult-mu-compose-current-draft-buffer mail-buffer)
       (cond
        ((stringp files)
         (cond
          ((and (not (file-directory-p files)) (file-truename files))
           (consult-mu-compose--attach-files (file-truename files) mail-buffer))
          ((and (file-directory-p files) (eq consult-mu-compose-use-dired-attachment 'always))
           (progn
             (split-window-sensibly)
             (with-current-buffer (dired files)
               (setq-local dired-mail-buffer mail-buffer))))
          ((and (file-directory-p files) (not (eq consult-mu-compose-use-dired-attachment 'always)))
           (progn
             (while (file-directory-p files)
               (setq files (consult-mu-compose--read-file-attach files)))
             (consult-mu-compose--attach-files (file-truename files) mail-buffer)))))
        ((listp files)
         (consult-mu-compose--attach-files files mail-buffer))))
      ('dired-mode
       (setq mail-buffer (or (and (bound-and-true-p dired-mail-buffer) (buffer-live-p dired-mail-buffer) dired-mail-buffer)
                             (consult-mu-compose-get-draft-buffer)
                             (if (version<= mu4e-mu-version "1.12")
                                 (mu4e-compose 'new) (mu4e-compose-new))))

       (cond
        ((and mail-buffer (buffer-live-p mail-buffer)))
        ((stringp mail-buffer) (with-current-buffer (if (version<= mu4e-mu-version "1.12")
                                                        (mu4e-compose 'new) (mu4e-compose-new))
                                 (save-excursion (message-goto-subject)
                                                 (insert mail-buffer)
                                                 (rename-buffer mail-buffer t)))
         (setq mail-buffer (get-buffer mail-buffer))))

       (if (and mail-buffer (buffer-live-p mail-buffer))
           (progn
             (setq-local dired-mail-buffer mail-buffer)
             (switch-to-buffer mail-buffer)
             (cond
              ((not files)
               (message "no files were selected!"))
              ((stringp files)
               (cond
                ((and (file-truename files) (not (file-directory-p files)))
                 (consult-mu-compose--attach-files (file-truename files) mail-buffer))
                ((and (not consult-mu-compose-use-dired-attachment) (file-directory-p files))
                 (progn
                   (while (file-directory-p files)
                     (setq files (consult-mu-compose--read-file-attach files)))
                   (consult-mu-compose--attach-files (file-truename files) mail-buffer)))))
              ((listp files)
               (consult-mu-compose--attach-files files mail-buffer))))))
      (_
       (setq mail-buffer (or
                          consult-mu-compose-current-draft-buffer
                          (consult-mu-compose-get-draft-buffer)
                          (if (version<= mu4e-mu-version "1.12")
                              (mu4e-compose 'new) (mu4e-compose-new))))
       (cond
        ((and mail-buffer (buffer-live-p mail-buffer)))
        ((stringp mail-buffer) (with-current-buffer (if (version<= mu4e-mu-version "1.12")
                                                        (mu4e-compose 'new) (mu4e-compose-new))
                                 (save-excursion (message-goto-subject)
                                                 (insert mail-buffer)
                                                 (rename-buffer mail-buffer t)))
         (setq mail-buffer (get-buffer mail-buffer))))
       (if (and mail-buffer (buffer-live-p mail-buffer))
           (progn
             (switch-to-buffer mail-buffer)
             (setq consult-mu-compose-current-draft-buffer mail-buffer)
             (cond
              ((and (not (file-directory-p files)) (file-truename files))
               (consult-mu-compose--attach-files (file-truename files) mail-buffer))
              ((and (file-directory-p files) (eq consult-mu-compose-use-dired-attachment 'always))
               (progn
                 (split-window-sensibly)
                 (with-current-buffer (dired files)
                   (setq-local dired-mail-buffer mail-buffer)
                   )))
              ((and (file-directory-p files) (not (eq consult-mu-compose-use-dired-attachment 'always)))
               (progn
                 (while (file-directory-p files)
                   (setq files (consult-mu-compose--read-file-attach files)))
                 (consult-mu-compose--attach-files (file-truename files) mail-buffer)))
              ((listp files)
               (consult-mu-compose--attach-files files mail-buffer))))))))
  mail-buffer)

(defun consult-mu-compose-detach (&optional file)
  "Remove FILE from email attachments interactively."
  (interactive)
  (save-mark-and-excursion
    (when-let (file (consult-mu-compose--read-file-remove))
      (consult-mu-compose--remove-files file))))
#+end_src

** Provide
#+begin_src emacs-lisp
;;; provide `consult-mu-compose' module
(provide 'consult-mu-compose)
#+end_src
** Footer
#+begin_src emacs-lisp
;;; consult-mu-compose.el ends here
#+end_src
* consult-mu-compose-embark.el
:PROPERTIES:
:header-args:emacs-lisp: :results none :mkdirp yes :comments none :tangle ./extras/consult-mu-compose-embark.el
:END:
*** Header
#+begin_src  emacs-lisp
;;; consult-mu-compose-embark.el --- Emabrk Actions for consult-mu-compose -*- lexical-binding: t -*-

;; Copyright (C) 2021-2023

;; Author: Armin Darvish
;; Maintainer: Armin Darvish
;; Created: 2023
;; Version: 1.0
;; Package-Requires: ((emacs "28.0") (consult "2.0"))
;; Homepage: https://github.com/armindarvish/consult-mu
;; Keywords: convenience, matching, tools, email
;; Homepage: https://github.com/armindarvish/consult-mu

;; SPDX-License-Identifier: GPL-3.0-or-later

;; This file is free software: you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published
;; by the Free Software Foundation, either version 3 of the License,
;; or (at your option) any later version.
;;
;; This file is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.
;;
;; You should have received a copy of the GNU General Public License
;; along with this file.  If not, see <https://www.gnu.org/licenses/>.


;;; Commentary:

;; This package provides an alternative interactive serach interface for
;; mu and mu4e (see URL `https://djcbsoftware.nl/code/mu/mu4e.html').
;; It uses a consult-based minibuffer completion for searching and
;; selecting, and marking emails, as well as additional utilities for
;; composing emails and more.

;;  This package requires mu4e version "1.10.8" or later.


;;; Code:
#+end_src
