consult-mu.org
*** Main
#+begin_src emacs-lisp
;;; Requirements
(require 'embark)
(require 'consult-mu)
(require 'consult-mu-embark)

(defun consult-mu-compose-embark-attach-file (cand)
  "Run `consult-mu-attach-files' on CAND."
  (funcall (apply-partially #'consult-mu-compose-attach cand)))

;;; add consult-mu-attach to embark-file-map
(defun consult-mu-compose-embark-bind-attach-file-key (&optional key)
  "Binds `consult-mu-embark-attach-file-key'.

Bind `consult-mu-embark-attach-file-key' to
`consult-mu-compose-embark-attach-file' in `embark-file-map'.  If KEY is
non-nil binds KEY instead of `consult-mu-embark-attach-file-key'."
  (if-let ((keyb (or key (kbd consult-mu-embark-attach-file-key))))
      (define-key embark-file-map keyb #'consult-mu-compose-embark-attach-file)))

(consult-mu-compose-embark-bind-attach-file-key)

;; change the default action on `consult-mu-contacts category.
(add-to-list 'embark-default-action-overrides '((file . consult-mu-compose--read-file-attach)  . consult-mu-compose-attach))
(add-to-list 'embark-default-action-overrides '((file . consult-mu-compose-attach)  . consult-mu-compose-attach))

;;; Provide `consult-mu-compose-embark' module

(provide 'consult-mu-compose-embark)

;;; consult-mu-compose-embark.el ends here
#+end_src

* consult-mu-contacts.el
:PROPERTIES:
:header-args:emacs-lisp: :results none :mkdirp yes :comments none :tangle ./extras/consult-mu-contacts.el
:END:
** Header
#+begin_src emacs-lisp
;;; consult-mu-contacts.el --- Consult Mu4e asynchronously -*- lexical-binding: t -*-

;; Copyright (C) 2023 Armin Darvish

;; Author: Armin Darvish
;; Maintainer: Armin Darvish
;; Created: 2023
;; Version: 1.0
;; Package-Requires: ((emacs "28.0") (consult "2.0"))
;; Homepage: https://github.com/armindarvish/consult-mu
;; Keywords: convenience, matching, tools, email
;; Homepage: https://github.com/armindarvish/consult-mu

;; SPDX-License-Identifier: GPL-3.0-or-later

;; This file is free software: you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published
;; by the Free Software Foundation, either version 3 of the License,
;; or (at your option) any later version.
;;
;; This file is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.
;;
;; You should have received a copy of the GNU General Public License
;; along with this file.  If not, see <https://www.gnu.org/licenses/>.


;;; Commentary:

;; This package provides an alternative interactive serach interface for
;; mu and mu4e (see URL `https://djcbsoftware.nl/code/mu/mu4e.html').
;; It uses a consult-based minibuffer completion for searching and
;; selecting, and marking emails, as well as additional utilities for
;; composing emails and more.

;;  This package requires mu4e version "1.10.8" or later.


;;; Code:

#+end_src

** Requirements
#+begin_src emacs-lisp
(require 'consult-mu)

#+end_src
** Define Group, Customs, Vars, etc.
*** Custom Variables
#+begin_src emacs-lisp
;;; Customization Variables

(defcustom consult-mu-contacts-group-by :name
  "What field to use to group the results in the minibuffer?

By default it is set to :name, but can be any of:

  :name    group by contact name
  :email   group by email of the contact
  :domain  group by the domain of the contact's email
           \(e.g. domain.com in user@domain.com\)
  :user    group by the ncontact's user name
           \(e.g. user in user@domain.com\)"
  :group 'consult-mu
  :type '(radio (const :name)
                (const :email)
                (const :domain)
                (const :user)))

(defcustom consult-mu-contacts-action #'consult-mu-contacts--list-messages-action
  "Which function to use when selecting a contact?

By default it is bound to
`consult-mu-contacts--list-messages-action'."
  :group 'consult-mu
  :type '(choice (function :tag "(Default) Show Messages from Contact" #'consult-mu-contacts--list-messages-action)
                 (function :tag "Insert Email" #'consult-mu-contacts--insert-email-action)
                 (function :tag "Copy Email to Kill Ring" #'consult-mu-contacts--copy-email-action)
                 (function :tag "Custom Function")))

(defcustom consult-mu-contacts-ignore-list (list)
  "List of Regexps to ignore when searching contacts.

This is useful to filter certain addreses from contacts.  For example, you
can remove no-reply adresses by setting this variable to
\='((“no-reply@example.com”))."
  :group 'consult-mu
  :type '(repeat :tag "Regexp List" regexp))

(defcustom consult-mu-contacts-ignore-case-fold-search case-fold-search
  "Whether to ignore case when matching against ignore-list?

When non-nil, `consult-mu-contacts' performs case *insensitive* match with
`consult-mu-contacts-ignore-list' and removes matches from candidates.

By default it is inherited from `case-fold-search'."
  :group 'consult-mu
  :type 'boolean)

#+end_src

*** Other Variables
#+begin_src emacs-lisp
;;; Other Variables

(defvar consult-mu-contacts-category 'consult-mu-contacts
  "Category symbol for contacts in `consult-mu' package.")

(defvar consult-mu-contacts--override-group nil
  "Override grouping in `consult-mu-contacs' based on user input.")

(defvar consult-mu-contacts--history nil
  "History variable for `consult-mu-contacts'.")

#+end_src

** Backend Commands
*** view messages form contact
#+begin_src emacs-lisp
(defun consult-mu-contacts--list-messages (contact)
  "List messages from CONTACT using `consult-mu'."
  (let* ((consult-mu-maxnum nil)
         (email (plist-get contact :email)))
    (consult-mu (format "contact:%s" email))))

(defun consult-mu-contacts--list-messages-action (cand)
  "Search the messages from contact candidate, CAND.

This is a wrapper function around `consult-mu-contacts--list-messages'.  It
parses CAND to extract relevant CONTACT plist and other information and
passes them to `consult-mu-contacts--list-messages'.

To use this as the default action for consult-mu-contacts, set
`consult-mu-contacts-default-action' to
\=#'consult-mu-contacts--list-messages-action."


  (let* ((info (cdr cand))
         (contact (plist-get info :contact)))
    (consult-mu-contacts--list-messages contact)))

#+end_src
*** insert contact
#+begin_src emacs-lisp
(defun consult-mu-contacts--insert-email (contact)
  "Insert email of CONTACT at point.

This is useful for inserting email when composing an email to contact."
  (let* ((email (plist-get contact :email)))
    (insert (concat email "; "))))

(defun consult-mu-contacts--insert-email-action (cand)
  "Insert the email from contact candidate, CAND.

This is a wrapper function around `consult-mu-contacts--insert-email'.  It
parses CAND to extract relevant CONTACT plist and other information and
passes them to `consult-mu-contacts--insert-email'.

To use this as the default action for consult-mu-contacts, set
`consult-mu-contacts-default-action' to
\=#'consult-mu-contacts--insert-email-action."
  (let* ((info (cdr cand))
         (contact (plist-get info :contact)))
    (consult-mu-contacts--insert-email contact)))

#+end_src
