extras/consult-mu-contacts.el

(defun consult-mu-contacts--copy-email (contact)
  "Copy email of CONTACT to kill ring."
  (let* ((email (plist-get contact :email)))
      (kill-new email)))

(defun consult-mu-contacts--copy-email-action (cand)
  "Copy the email from contact candidate, CAND, to kill ring.

This is a wrapper function around `consult-mu-contacts--copy-email'.  It
parses CAND to extract relevant CONTACT plist and other information and
passes them to `consult-mu-contacts--copy-email'.

To use this as the default action for consult-mu-contacts, set
`consult-mu-contacts-default-action' to
\=#'consult-mu-contacts--copy-email-action."
  (let* ((info (cdr cand))
         (contact (plist-get info :contact)))
    (consult-mu-contacts--copy-email contact)))

(defun consult-mu-contacts--compose-to (contact)
  "Compose an email to CONTACT using `mu4e-compose-new'."
  (let* ((email (plist-get contact :email)))
         (mu4e-compose-new email)))

(defun consult-mu-contacts--compose-to-action (cand)
  "Open a new buffer to compose a message to contact candidate, CAND.

This is a wrapper function around `consult-mu-contacts--compose-to'.  It
parses CAND to extract relevant CONTACT plist and other information and
passes them to `consult-mu-contacts--compose-to'.

To use this as the default action for consult-mu-contacts, set
`consult-mu-contacts-default-action' to \=#'consult-mu-contacts--compose-to-action."

  (let* ((info (cdr cand))
         (contact (plist-get info :contact)))
    (consult-mu-contacts--compose-to contact)))

(defun consult-mu-contacts--format-candidate (string input highlight)
  "Format minibuffer candidates for `consult-mu-contacts'.

STRING is the output retrieved from “mu cfind INPUT ...” in the command
line.

INPUT is the query from the user.

If HIGHLIGHT is non-nil, input is highlighted with
`consult-mu-highlight-match-face' in the minibuffer."
  (let* ((query input)
         (email (consult-mu--message-extract-email-from-string string))
         (name (string-trim (replace-regexp-in-string email "" string nil t nil nil)))
         (contact (list :name name :email email))
         (match-str (if (stringp input) (consult--split-escaped (car (consult--command-split query))) nil))
         (str (format "%s\s\s%s"
                      (propertize (consult-mu--set-string-width email (floor (* (frame-width) 0.55))) 'face 'consult-mu-sender-face)
                      (propertize name 'face 'consult-mu-subject-face)))
         (str (propertize str :contact contact :query query)))
    (if (and consult-mu-highlight-matches highlight)
        (cond
         ((listp match-str)
          (mapc (lambda (match) (setq str (consult-mu--highlight-match match str t))) match-str))
         ((stringp match-str)
          (setq str (consult-mu--highlight-match match-str str t))))
      str)
    (cons str (list :contact contact :query query))))

(defun consult-mu-contacts--add-history ()
  "Get list of emails in the current buffer.

This is used to add the emails in the current buffer to history."
  (let ((add (list)))
    (pcase major-mode
      ((or mu4e-view-mode mu4e-compose-mode org-msg-edit-mode message-mode)
       (mapcar (lambda (item)
                 (concat "#" (consult-mu--message-extract-email-from-string item)))
               (append add
                       (consult-mu--message-emails-string-to-list (consult-mu--message-get-header-field "from"))
                       (consult-mu--message-emails-string-to-list (consult-mu--message-get-header-field "to"))
                       (consult-mu--message-emails-string-to-list (consult-mu--message-get-header-field "cc"))
                       (consult-mu--message-emails-string-to-list (consult-mu--message-get-header-field "bcc"))
                       (consult-mu--message-emails-string-to-list (consult-mu--message-get-header-field "reply-to")))))
      (_ (list)))))

(defun consult-mu-contacts--group-name (cand)
  "Get the group name of CAND using `consult-mu-contacts-group-by'.

See `consult-mu-contacts-group-by' for details of grouping options."
(let* ((contact (get-text-property 0 :contact cand))
       (email (plist-get contact :email))
       (name (plist-get contact :name))
       (_ (string-match "\\(?1:[a-zA-Z0-9\_\.\+\-]+\\)@\\(?2:[a-zA-Z0-9\-]+\.[a-zA-Z0-9\-\.]+\\)" email))
       (user (match-string 1 email))
       (domain (match-string 2 email))
       (group (or consult-mu-contacts--override-group consult-mu-contacts-group-by))
      (field (if (not (keywordp group)) (intern (concat ":" (format "%s" group))) group)))
      (pcase field
        (:email email)
        (:name (if (string-empty-p name) "n/a" name))
        (:domain domain)
        (:user user)
        (_ nil))))

(defun consult-mu-contacts--group (cand transform)
"Group function for `consult-mu-contacts' candidates.

CAND `consult-mu-contacts--group-name' to get the group name for contact.
When TRANSFORM is non-nil, the name of the candiate is used as group title."
  (when-let ((name (consult-mu-contacts--group-name cand)))
    (if transform (substring cand) name)))

(defun consult-mu-contacs--lookup ()
  "Lookup function for `consult-mu-contacs' minibuffer candidates.

This is passed as LOOKUP to `consult--read' on candidates and is used to
format the output when a candidate is selected."
  (lambda (sel cands &rest args)
    (let* ((info (cdr (assoc sel cands)))
           (contact  (plist-get info :contact))
           (name (plist-get contact :name))
           (email (plist-get contact :email)))
      (cons (or name email) info))))

(defun consult-mu-contatcs--predicate (cand)
  "Predicate function for `consult-mu-contacs' candidate, CAND.

This is passed as Predicate to `consult--read' on candidates and is used to
remove contacts matching `consult-mu-contacts-ignore-list' from the list of
candidtaes.

Note that `consult-mu-contacts-ignore-case-fold-search' is used to define
case (in)sensitivity as well."

  (let* ((contact (plist-get (cdr cand) :contact))
         (email (plist-get contact :email))
         (name (plist-get contact :name))
         (case-fold-search consult-mu-contacts-ignore-case-fold-search))
    (if (seq-empty-p (seq-filter (lambda (reg) (or (string-match-p reg email)
                                                   (string-match-p reg name)))
                                 consult-mu-contacts-ignore-list))
        t
      nil)))

(defun consult-mu-contacts--state ()
  "State function for `consult-mu-contacts' candidates.

This is passed as STATE to `consult--read' and is used to preview or do
other actions on the candidate."
  (lambda (action cand)
    (let ((preview (consult--buffer-preview)))
      (pcase action
        ('preview)
        ('return
         (save-mark-and-excursion
           (consult-mu--execute-all-marks))
         (setq consult-mu-contacts--override-group nil)
         cand)))))

(defun consult-mu-contacts--transform (input)
  "Add annotation to minibuffer candiates for `consult-mu-contacts'.

Format each candidates with `consult-gh--repo-format' and INPUT."
  (lambda (cands)
    (cl-loop for cand in cands
             collect
             (consult-mu-contacts--format-candidate cand input t))))
