consult-mu.org
***** builder
#+begin_src emacs-lisp
(defun consult-mu-contacts--builder (input)
  "Build mu command line for searching contacts by INPUT."
  (pcase-let* ((consult-mu-args (append consult-mu-args '("cfind")))
               (cmd (consult--build-args consult-mu-args))
               (`(,arg . ,opts) (consult--command-split input))
               (flags (append cmd opts)))
    (unless (or (member "-n" flags) (member "--maxnum" flags))
      (if (and consult-mu-maxnum (> consult-mu-maxnum 0))
          (setq opts (append opts (list "--maxnum" (format "%s" consult-mu-maxnum))))))
    (if (or (member "-g" opts)  (member "--group" opts))
        (cond
         ((member "-g" opts)
          (setq consult-mu-contacts--override-group (ignore-errors (intern (nth (+ (cl-position "-g" opts :test 'equal) 1) opts))))
          (setq opts (remove "-g" (remove (ignore-errors (nth (+ (cl-position "-g" opts :test 'equal) 1) opts)) opts))))
         ((member "--group" opts)
          (setq consult-mu-contacts--override-group (ignore-errors (intern (nth (+ (cl-position "--group" opts :test 'equal) 1) opts))))
          (setq opts (remove "--group" (remove (ignore-errors (nth (+ (cl-position "--group" opts :test 'equal) 1) opts)) opts)))))
      (setq consult-mu-contacts--override-group nil))
    (pcase-let* ((`(,re . ,hl) (funcall consult--regexp-compiler arg 'pcre t)))
      (when re
        (cons (append cmd
                      (list (string-join re " "))
                      opts)
              hl)))))

#+end_src


***** internal async command
#+begin_src emacs-lisp :lexical t
(defun consult-mu-contacts--async (prompt builder &optional initial)
  "Query mu4e contacts asynchronously.

This is a non-interactive internal function.  For the interactive version
see `consult-mu-contacts'.

It runs the command line from `consult-mu-contacts--builder' in an async
process and returns the results \(list of contacts\) as a completion table
in minibuffer that will be passed to `consult--read'.  The completion table
gets dynamically updated as the user types in the minibuffer.  Each
candidate in the minibuffer is formatted by
`consult-mu-contacts--transform' to add annotation and other info to the
candidate.

Description of Arguments:
  PROMPT  the prompt in the minibuffer.
          \(passed as PROMPT to `consult--red'\)
  BUILDER an async builder function passed to `consult--async-command'.
  INITIAL an optional arg for the initial input in the minibuffer.
          \(passed as INITITAL to `consult--read'\)

commandline arguments/options \(run “mu cfind --help” in the command line
for details\) can be passed to the minibuffer input similar to
`consult-grep'.  For example the user can enter:

“#john -- --maxnum 10”

This will search for contacts with the query “john”, and retrives a maximum
of 10 contacts.

Also, the results can further be narrowed by
`consult-async-split-style' \(e.g. by entering “#” when
`consult-async-split-style' is set to \='perl\).

For example:

“#john -- --maxnum 10#@gmail”

Will retrieve the message as the example above, then narrows down the
completion table to candidates that match “@gmail”."
  (consult--read
   (consult--process-collection builder
     :transform (consult--async-transform-by-input #'consult-mu-contacts--transform))
   :prompt prompt
   :lookup (consult-mu-contacs--lookup)
   :state (funcall #'consult-mu-contacts--state)
   :initial initial
   :group #'consult-mu-contacts--group
   :add-history (consult-mu-contacts--add-history)
   :history '(:input consult-mu-contacts--history)
   :category 'consult-mu-contacts
   :preview-key consult-mu-preview-key
   :predicate #'consult-mu-contatcs--predicate
   :sort t))

#+end_src


***** interactive command
#+begin_src emacs-lisp
(defun consult-mu-contacts (&optional initial noaction)
    "List results of “mu cfind” asynchronously.

This is an interactive wrapper function around
`consult-mu-contacts--async'.  It queries the user for a search term in the
minibuffer, then fetches a list of contacts for the entered search term as
a minibuffer completion table for selection.  The list of candidates in the
completion table are dynamically updated as the user changes the entry.

INITIAL is an optional arg for the initial input in the minibuffer \(passed
as INITITAL to `consult-mu-contacts--async'\).

Upon selection of a candidate either
 - the candidate is returned if NOACTION is non-nil
 or
 - the candidate is passed to `consult-mu-contacts-action' if NOACTION is
   nil.

Additional commandline arguments can be passed in the minibuffer entry by
typing “--” followed by command line arguments.

For example the user can enter:

“#john doe -- -n 10”

This will run a contact search with the query “john doe” and changes the
search limit to 10.

Also, the results can further be narrowed by `consult-async-split-style'
\(e.g. by entering “#” when `consult-async-split-style' is set to \='perl\).


For example:

“#john doe -- -n 10#@gmail”

will retrieve the message as the example above, then narrows down to the
candidates that match “@gmail”.

For more details on consult--async functionalities, see `consult-grep' and
the official manual of consult, here: https://github.com/minad/consult."
  (interactive)
  (save-mark-and-excursion
  (consult-mu--execute-all-marks))
  (let* ((sel
        (consult-mu-contacts--async (concat "[" (propertize "consult-mu-contacts" 'face 'consult-mu-sender-face) "]" " Search Contacts:  ") #'consult-mu-contacts--builder initial)))
    (save-mark-and-excursion
      (consult-mu--execute-all-marks))
    (if noaction
        sel
      (progn
        (funcall consult-mu-contacts-action sel)
        sel))))

#+end_src

** Provide
#+begin_src emacs-lisp
;;; provide `consult-mu-contacts' module
(provide 'consult-mu-contacts)

#+end_src
** Footer
#+begin_src emacs-lisp
;;; consult-mu-contacts.el ends here
#+end_src
* consult-mu-contacts-embark.el
:PROPERTIES:
:header-args:emacs-lisp: :results none :mkdirp yes :comments none :tangle ./extras/consult-mu-contacts-embark.el
:END:
*** Header
#+begin_src  emacs-lisp
;;; consult-mu-contacts-embark.el --- Emabrk Actions for consult-mu-contacts -*- lexical-binding: t -*-

;; Copyright (C) 2021-2023

;; Author: Armin Darvish
;; Maintainer: Armin Darvish
;; Created: 2023
;; Version: 1.0
;; Package-Requires: ((emacs "28.0") (consult "2.0"))
;; Homepage: https://github.com/armindarvish/consult-mu
;; Keywords: convenience, matching, tools, email
;; Homepage: https://github.com/armindarvish/consult-mu

;; SPDX-License-Identifier: GPL-3.0-or-later

;; This file is free software: you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published
;; by the Free Software Foundation, either version 3 of the License,
;; or (at your option) any later version.
;;
;; This file is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.
;;
;; You should have received a copy of the GNU General Public License
;; along with this file.  If not, see <https://www.gnu.org/licenses/>.


;;; Commentary:

;; This package provides an alternative interactive serach interface for
;; mu and mu4e (see URL `https://djcbsoftware.nl/code/mu/mu4e.html').
;; It uses a consult-based minibuffer completion for searching and
;; selecting, and marking emails, as well as additional utilities for
;; composing emails and more.

;;  This package requires mu4e version "1.10.8" or later.


;;; Code:

#+end_src

